Revit 2025 API
RebarContainerParameterManager.AddOverride(ElementId, Double) Method
 Adds an override for the given parameter as its value will be displayed for the Rebar Container element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public void AddOverride(
	ElementId paramId,
	double value
)
Public Sub AddOverride (
	paramId As ElementId,
	value As Double
)
public:
void AddOverride(
	ElementId^ paramId,
	double value
)
member AddOverride :
        paramId : ElementId *
        value : float -> unit
Parameters
paramId ElementId
 The id of the parameter
value Double
 The override value of the parameter.
Exceptions
Exception | Condition
ArgumentException |  paramId is not the id of a parameter in the current document, or its value type is not double. -or- paramId is not a Rebar Container parameter
ArgumentNullException |  A non-optional argument was null
Example
// Override the value for A and set the parameter to modifiable for the given rebar container
void ManageParameters(RebarContainer container)
{
    RebarContainerParameterManager paramManager = container.GetParametersManager();
    Parameter aParam = container.LookupParameter("A");
    if (aParam != null)
    {
        paramManager.AddOverride(aParam.Id, 0.4);
        paramManager.SetOverriddenParameterModifiable(aParam.Id);
    }
}
' Override the value for A and set the parameter to modifiable for the given rebar container
Private Sub ManageParameters(container As RebarContainer)
    Dim paramManager As RebarContainerParameterManager = container.GetParametersManager()
    Dim aParam As Parameter = container.LookupParameter("A")
    If aParam IsNot Nothing Then
        paramManager.AddOverride(aParam.Id, 0.4)
        paramManager.SetOverriddenParameterModifiable(aParam.Id)
    End If
End Sub
No code example is currently available or this language may not be supported.
No code example is currently available or this language may not be supported.
See Also
Reference
RebarContainerParameterManager Class
AddOverride Overload
Autodesk.Revit.DB.Structure Namespace